
class Defects():

    def __init__(self):
        self.map = self.get_defects_map()

    def get_defects_map(self):

        defects = {}

        defects["surface"] = [

            "堆钢", "轧破", "烂尾", "辊印",

            "溢出", "塔形", "松卷", "交错", "塌卷", "扁卷",

            "鱼尾",

            "铸坯划伤", "划伤",

            "线状夹杂", "边部夹杂", "柳叶型夹杂", "气泡夹杂", "夹杂"

            "角部裂纹", "边部裂纹", "裂纹",

            "气泡",

            "斑纹压氧", "凹坑压氧", "压氧"

            "锈垢压入", "金属压入", "油污压入", "压入"

            "麻点",

            "折叠", "边损",

            "边部翘皮",

            "紅锈", "色差", "锯齿边", "走刀痕", "油污"

        ]

        defects["shape"] = [

            "W40绝对值均值",

            "W40稳定性",

            "边降C25-C40均值",

            "边降C40-C100均值"
        ]

        return defects
